
"""
Тъй като за потребител използваме готовият, който пристига от джанго на готово този файл няма много фукнционалости
въпреки това имаме възможността да разтеглим функционалностите на този модел като му добавим допълнителни функции
в този случай добавяме функция която проверява дали потребителят е регистриран за изпит като връща true  или  false.
Обикнове, ако се нуждаем от повече фукнционалност върху потребител модела от джанго имаме няколко вариатна
единият е да създатем OneToOne връзка между потребителят и друг модел например Profile по този начин заявяваме,че един потребител има един единствен профил, който може да съдържа неща като телефонен номер адрес и много други неща,които не са включени във този модел.
другият начин е да използваме свойствата от обектно ориентираното програмиране и да наследим обекта потребил от джанго и 
да го 'потробим като му добавим нови полета с информация и функционалности.
"""
from django.db import models
from django.contrib import auth

def is_registered_for_exam(self,exam):
    return self.exam_applications.filter(exam=exam).exists()


auth.models.User.add_to_class('is_registered_for_exam', is_registered_for_exam)

# Create your models here.

